README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Proj</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Proj"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-24"/>
<meta name="author" content="Dario Hamidi"/>
</head>
<body>
<div id="content">
<h1 class="title">Proj</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Name</a></li>
<li><a href="#sec-2">2. Description</a></li>
<li><a href="#sec-3">3. Usage</a></li>
<li><a href="#sec-4">4. Templates</a></li>
<li><a href="#sec-5">5. Handlers</a></li>
<li><a href="#sec-6">6. Adding new handlers</a></li>
<li><a href="#sec-7">7. Todo</a></li>
<li><a href="#sec-8">8. Requires</a></li>
<li><a href="#sec-9">9. License &amp; Copyright</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Name</h2>
<div class="outline-text-2" id="text-1">
<p>
proj <code>/prɔʣ/</code> &#x2013; create files and directories based on templates.
</p>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Description</h2>
<div class="outline-text-2" id="text-2">
<p>
Proj is a tool born from the desire to automate the tedious tasks when
starting to work on a website.  Proj creates files and directories
based on so called "templates" which define a directory structure and
actions to perform after processing a template, such as initializing a
git repository.  Templates are general enough to be useful for any kind
of task that benefits from any sort of scaffolding.
</p>

<p>
Proj tries to not break any things and does not overwrite any files by
default.  Single files can be overwritten in the target directory by
explicitly saying so in the template.  If anything goes wrong during
the processing of a template, all files created so far are deleted in
order to not leave the target directory in any inconsistent state.
</p>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
<p>
Templates are processed with <i>proj-create</i>:
</p>

<pre class="example">
proj-create [[-i|--include] INCLUDE] TEMPLATE [DEFINITION ...]
</pre>

<p>
The option <code>-i</code> adds directory <code>INCLUDE</code> to the list of directories to
search for templates.  The <code>-i</code> option can be used more than once.
<code>TEMPLATE</code> is the name of the template to create. <code>DEFINITION</code> is a
key-value pair separated by an equal sign, e.g. <code>title=Foo</code>.  All current
environment variables and definitions are made available as variables
within files processed by <a href="http://tt2.org">Template Toolkit</a>.
</p>

<p>
By default, <code>proj-create</code> looks for templates in <code>$HOME/.proj.d</code> and the
directories given in the environment variable <code>PROJ_PATH</code>.  Multiple
directories can be given in that variable by separating them with a
colon (<code>:</code>).
</p>

<p>
Before running, <code>proj-create</code> evaluates the file <code>$HOME/.proj.pl</code> as
perl code if it exists.  Currently this is only useful for <a href="#sec-6">adding new
handlers</a>.
</p>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Templates</h2>
<div class="outline-text-2" id="text-4">
<p>
Templates are regular perl code that is evaluated when processing a
template.  Proj is instrumented by setting certain variables in the
template, but any perl code can be used in a template.  Each template
requires an additional directory of the same name suffixed with <code>.d</code> to
exist.  This directory contains all the files referenced in the
template.
</p>

<div class="org-src-container">
<label class="org-src-name">Example template</label>
<pre class="src src-perl"><span style="color: #a0522d;">$tree</span> = [
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">html</span> =&gt;
      [ <span style="color: #006400; font-weight: bold;">file</span> =&gt; <span style="color: #006400; font-weight: bold;">'index.html'</span> ]],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">template</span> =&gt;
      [ <span style="color: #006400; font-weight: bold;">file</span> =&gt; <span style="color: #006400; font-weight: bold;">'default.html.tt'</span> ]],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">css</span> =&gt;
      [ <span style="color: #006400; font-weight: bold;">file</span>  =&gt; <span style="color: #006400; font-weight: bold;">"devel.css"</span> ],
      [ <span style="color: #006400; font-weight: bold;">file</span>  =&gt; <span style="color: #006400; font-weight: bold;">"yaml"</span> ],],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">js</span> =&gt;
      [ <span style="color: #006400; font-weight: bold;">http</span> =&gt; <span style="color: #006400; font-weight: bold;">'code.jquery.com/jquery.min.js'</span>],
      [ <span style="color: #006400; font-weight: bold;">http</span> =&gt; <span style="color: #006400; font-weight: bold;">'html5shim.googlecode.com/svn/trunk/html5.js'</span>],
      [ <span style="color: #006400; font-weight: bold;">http</span> =&gt; <span style="color: #006400; font-weight: bold;">'code.jquery.com/jquery.js'</span>],],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'images'</span> ],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'perl'</span>   ],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'cgi-bin'</span>],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'log'</span>    ],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'tmp'</span>    ],
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'conf'</span>,
    [ <span style="color: #006400; font-weight: bold;">file</span> =&gt; <span style="color: #006400; font-weight: bold;">'lighttpd.conf'</span> ]],
];

<span style="color: #a0522d;">$after</span> = [
  <span style="color: #006400; font-weight: bold;">'git init'</span>,
  <span style="color: #006400; font-weight: bold;">'git add .'</span>,
  <span style="color: #006400; font-weight: bold;">'git commit -m "initial commit"'</span>,
 ];
</pre>
</div>

<p>
The following variables have a special meaning in templates:
</p>
<dl class="org-dl">
<dt> <code>$tree</code> </dt><dd>this variable describes the directory structure that is to
be created. Its value has to be an arrayref of entries,
where each entry is of the form <code>[ $HANDLER, @ARGS ]</code>.
<code>$HANDLER</code> names a function in the package <code>Proj::Handler</code>
and <code>@ARGS</code> are the arguments passed to that function.  If
any coderefs in an entry are replaced by the value
obtained by calling the referenced function without arguments.
</dd>
<dt> <code>$before</code>, <code>$after</code> </dt><dd>these variables provide hooks for running code
or shell commands before and after the structure defined in <code>$tree</code>
has been created. Their values are arrayrefs of strings or
coderefs.  A string is taken as a shell command and executed with
<code>system</code>, a coderef is called without arguments.
</dd>
</dl>

<p>
Templates are evaluated within the package <code>Proj::Template</code>, so any
functions defined in that packed can be used in the template without
importing any modules.  One function, <code>extends</code>, is defined by default
in that package.  It takes a list (NB! not an arrayref) of template
names and creates those in the current directory.  This is mainly useful
for extending templates (e.g. to customize shared templates for the
local environment).
</p>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Handlers</h2>
<div class="outline-text-2" id="text-5">
<p>
The following handlers are defined by default for use in <code>$tree</code>
entries:
</p>

<dl class="org-dl">
<dt> <code>dir $name @children</code> </dt><dd>creates directory <code>$name</code> and processes
child entries <code>@children</code>.  The current directory is set to
<code>$name</code> while processing <code>@children</code>.

<p>
Example:
</p>
<div class="org-src-container">

<pre class="src src-perl"><span style="color: #a0522d;">$tree</span> = [
  [ <span style="color: #006400; font-weight: bold;">dir</span> =&gt; <span style="color: #006400; font-weight: bold;">'foo'</span>,
    [<span style="color: #006400; font-weight: bold;">file</span> =&gt; <span style="color: #006400; font-weight: bold;">'bar'</span>]],
];
</pre>
</div>
</dd>

<dt> <code>file $name \%options</code> </dt><dd>creates file <code>$name</code> by copying it from the
template directory.  There are four locations relative to the
template directory that are checked in order to find the source
file for <code>$name</code> (where <code>$CWD</code> is the current directory relative
to the template directory):

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>File Locations for foo/bar</caption>

<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Location</th>
<th scope="col" class="left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>$name.tt</code></td>
<td class="left"><code>bar.tt</code></td>
</tr>

<tr>
<td class="left"><code>$name</code></td>
<td class="left"><code>bar</code></td>
</tr>

<tr>
<td class="left"><code>$PWD/$name.tt</code></td>
<td class="left"><code>foo/bar.tt</code></td>
</tr>

<tr>
<td class="left"><code>$PWD/$name</code></td>
<td class="left"><code>foo/bar</code></td>
</tr>
</tbody>
</table>

<p>
The first existing file is used.  If the file name equal
<code>$name.tt</code>, then the file will be processed as a <a href="http://tt2.org">Template Toolkit</a>
template.
</p>

<p>
If <code>$options-&gt;{overwrite}</code> is set to a true value, <code>$name</code> in the
target directory will be overwritten if it exists.
</p>
</dd>

<dt> <code>http $url $filename</code> </dt><dd>Uses <code>LWP::Simple::mirror($url)</code> in the
<span class="underline">template directory</span> before copying the file named in <code>$url</code> to the
target directory.  If <code>$filename</code> is given, it will be used as the
target file name instead.

<p>
Example:
</p>
<div class="org-src-container">

<pre class="src src-perl">[<span style="color: #006400; font-weight: bold;">http</span> =&gt; <span style="color: #006400; font-weight: bold;">'code.jquery.com/jquery.js'</span>]
</pre>
</div>
</dd>
</dl>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Adding new handlers</h2>
<div class="outline-text-2" id="text-6">
<p>
It is possible to define own handlers with the function <code>defhandler</code> in
the proj configuration file (<code>~/.proj.pl</code>).  <code>defhandler</code> takes two
arguments: the name of the new handler and a coderef to associate with
that name.  It is basically just syntactic sugar for installing
functions into <code>Proj::Handler</code>.
</p>

<p>
A function installed with <code>defhandler</code> is called with a variable number
of arguments.  The first argument is always a instance of <code>Proj</code>, all
other arguments are taken from the entry in <code>$tree</code>, excluding the
handler name.  The current working directory is set according to the
location in <code>$tree</code>.  If the handler creates any files that should be
deleted in case of error, those file names should be registered with the
<code>_register(@filenames)</code> method of the <code>Proj</code> instance.  To abort the
processing of the current template, use the <code>_fail($message)</code> method of
the <code>Proj</code> instance.  This exits the program with exit code <code>1</code> and
removes all files created during this run.
</p>

<p>
A <code>git</code> handler that clones a repository if it doesn't exist already
and otherwise pulls the newest version could look like this:
</p>
<div class="org-src-container">

<pre class="src src-perl"><span style="color: #b22222;"># </span><span style="color: #b22222;">in file ~/.proj.pl</span>
defhandler <span style="color: #006400; font-weight: bold;">git</span> =&gt; <span style="color: #daa520; font-weight: bold;">sub</span> {
  <span style="color: #daa520; font-weight: bold;">my</span> (<span style="color: #a0522d;">$proj</span>,<span style="color: #a0522d;">$repo_url</span>,<span style="color: #a0522d;">$opts</span>) = <span style="color: #0000ff; font-weight: bold;">@_</span>;

  <span style="color: #daa520; font-weight: bold;">my</span> <span style="color: #a0522d;">$repo_name</span> = (<span style="color: #ff0000;">split</span> <span style="color: #006400; font-weight: bold;">'/'</span>,<span style="color: #a0522d;">$repo_url</span>)[-1];

  <span style="color: #daa520; font-weight: bold;">if</span> (<span style="color: #0000ff;">-e</span> <span style="color: #a0522d;">$repo_name</span>) {
    <span style="color: #a0522d;">$proj</span>-&gt;_diag(<span style="color: #006400; font-weight: bold;">"pull $repo_url"</span>);
    <span style="color: #ff0000;">qx</span><span style="color: #006400; font-weight: bold;">{pushd $repo_name; git pull; popd}</span>;
  }
  <span style="color: #daa520; font-weight: bold;">else</span> {
    <span style="color: #a0522d;">$proj</span>-&gt;_diag(<span style="color: #006400; font-weight: bold;">"clone $repo_url"</span>);
    <span style="color: #a0522d;">$opts</span> ||= <span style="color: #006400; font-weight: bold;">''</span>;
    <span style="color: #ff0000;">qx</span><span style="color: #006400; font-weight: bold;">{git clone $opts $repo_url}</span>;
  }

};
</pre>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Todo</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>add on-line help to proj-create
</li>
<li>add comments to the code
</li>
<li>add example templates
</li>
</ul>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Requires</h2>
<div class="outline-text-2" id="text-8">
<p>
Proj requires the following perl modules to be installed:
</p>

<ul class="org-ul">
<li>Template
</li>
<li>LWP::Simple
</li>
</ul>
</div>
</div>
<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> License &amp; Copyright</h2>
<div class="outline-text-2" id="text-9">
<p>
Copyright (C) 2013 Dario Hamidi <code>&lt;dario.hamidi@gmail.com&gt;</code>.
</p>

<p>
This module is free software; you can redistribute it and/or modify it
under the same terms as Perl itself.
</p>
</div>
</div>
</div>
<div id="postamble">
<p class="date">Date: 2013-03-24</p>
<p class="author">Author : Dario Hamidi</p>
<p class="creator">Generated by <a href="http://orgmode.org">Org</a> mode 8.0-pre in <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1.</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</body>
</html>
